Repository: angelzagniy/Library
Catalog: Library.web/Resources/Shared.*.resx
Languages: uk_ua

source: Title
uk_ua: Назва

source: Book number is required
uk_ua: Треба вказати кількість

# BookNumberRange
source: The number of books should be between 1 and 30.
uk_ua: Кількість книжок повинна бути від 1 до 30

source: Author
uk_ua: Автор

source: Authors
uk_ua: Автори

source: Name
uk_ua: ПІБ

source: Login
uk_ua: Вхід

source: Members
uk_ua: Читачі

source: Library
uk_ua: Бібліотека

source: Home
uk_ua: Головна

source: Books
uk_ua: Книжки

source: Users
uk_ua: Користувачі

source: Logout
uk_ua: Вихід

source: Phone number
uk_ua: Номер телефону

source: Genre
uk_ua: Жанр

source: Add New Book
uk_ua: Додати книжку

source: Year
uk_ua: Рік

source: Available/Total
uk_ua: Доступно/Всього

source: Cancel
uk_ua: Скасувати

source: Submit
uk_ua: Підтвердити

source: Add Author
uk_ua: Додати автора

source: Update Author
uk_ua: Редагувати автора

source: Instances Count
uk_ua: Кількість примірників

source: Add Book
uk_ua: Додати книжку

source: Manage Book
uk_ua: Керування книжками

source: Lend
uk_ua: Видати

source: Return
uk_ua: Повернути

source: Available
uk_ua: Вільно

source: Taken by
uk_ua: Видано

source: Instances
uk_ua: Примірники

source: Lend Book
uk_ua: Видати книжку

source: Select a member
uk_ua: Вибрати читача

source: Select genre
uk_ua: Вибрати жанр

source: Update Book
uk_ua: Редагувати книжку

source: You have insufficient privileges to access this page.
uk_ua: У вас обмежені права для доступу до цієї сторінки.

source: UserName
uk_ua: Логін

source: Password
uk_ua: Пароль

source: Add Library Member
uk_ua: Додати читача

source: Taken Books
uk_ua: Видано

source: Update Member
uk_ua: Редагувати читача

source: Role
uk_ua: Роль

source: Repeat Password
uk_ua: Повторіть пароль

source: Add User
uk_ua: Додати користувача

source: Error.
uk_ua: Помилка.

source: An error occurred while processing your request.
uk_ua: Сталася помилка при обробці Вашого запиту.

source: Request ID:
uk_ua: ID запита:

source: Development
uk_ua: Розробка

source: Swapping to
uk_ua: Зміна на

source: Development Mode
uk_ua: Режим розробки

source: environment will display more detailed information about the error that occurred.
uk_ua: середовище відобразить більш детальну інформацію про помилку, що сталася.

source: The Development environment shouldn't be enabled for deployed applications.
uk_ua: Середовище розробки не має бути ввімкнено для розгорнутих програм.

source: It can result in displaying sensitive information from exceptions to end users.
uk_ua: Це може призвести до відображення конфіденційної інформації винятків кінцевим користувачам.

source: For local debugging, enable the
uk_ua: Для локального налагодження увімкніть

source: environment by setting the
uk_ua: середовища, встановивши

source: environment variable to
uk_ua: змінна середовища до

source: and restarting the app.
uk_ua: і перезапуск програми.

source: Actions
uk_ua: Дії

source: Update User
uk_ua: Редагувати користувача

source: User Details
uk_ua: Інформація про користувача

source: Close
uk_ua: Закрити

source: AuthorIsRequired
uk_ua: Автор обов'язковий

source: User Name Is Required.
uk_ua: ПІБ обов'язкове.

source: Login Name Is Required
uk_ua: Логін обов'язковий

source: Role is required
uk_ua: Роль обов'язкова

source: Password Is Required
uk_ua: Пароль обов'язковий

source: Author Name Is Required
uk_ua: ПІБ автора обов'язкове

# PhoneNumberShouldBeInFormat
source: Phone number should be in format +380#########
uk_ua: Номер телефону має бути у форматі +380#########

source: Phone Number Is Required
uk_ua: Номер телефону обов'язковий

source: Member Name Is Required
uk_ua: ПІБ читача обов'язкове

source: Back to members
uk_ua: Повернутись до читачів

source: Select genre...
uk_ua: Виберіть жанр...

source: Type name here...
uk_ua: Введіть ім'я...

source: Science Fiction
uk_ua: Наукова фантастика

source: Authentication failed
uk_ua: Не авторизовано

source: ISBN is required
uk_ua: ISBN обов'язковий

source: Book title is required
uk_ua: Назва обов'язкова

source: Genre is required
uk_ua: Жанр обов'язковий

source: Publish year should be between 1800 and 2024
uk_ua: Рік видання має бути з 1800 до 2024

source: The format should ISBN 10 or 13
uk_ua: ISBN має бути у форматі 10 або 13 символів

source: Book title should not exceed 100 characters
uk_ua: Назва не може перевищувати 100 символів

# Інформаційна система &quot;Бібліотека&quot;
source: Information System "Library"
uk_ua: Інформаційна система "Бібліотека"

# Деталі проєкту
source: General Info
uk_ua: Деталі проєкту

# Проєкт створений для автоматизації роботи бібліотеки.
source: The project was created to automate the work of the library.
uk_ua: Проєкт створений для автоматизації роботи бібліотеки.

source: Employees will be able to replace paper records with digital ones. Data about books, authors and readers will be stored in the database. The convenient and intuitive interface of this system will be an assistant in work and will significantly help to easily keep records and quickly find the necessary information.
uk_ua: Працівники зможуть замінити паперовий облік на цифровий. Дані про книжки, авторів та читачів зберігатимуться у базі даних. Зручний та інтуїтивний інтерфейс даної системи буде помічником в роботі та значно допоможе легко вести облік та швидко знаходити необхідну інформацію.

# Модель даних
source: Data Model
uk_ua: Модель даних

# Доступ до даних може бути отримано тільки після авторизації.
source: Access to data can be obtained only after authorization.
uk_ua: Доступ до даних може бути отримано тільки після авторизації.

source: A system administrator can register a new user. If you do not have a login and password, contact the administrator.
uk_ua: Зареєструвати нового користувача може адміністратор системи. Якщо Ви не маєте логіна та пароля, зверніться до адміністратора.

# Доступ до інформації
source: Managed Access
uk_ua: Доступ до інформації

# Про систему
source: About System
uk_ua: Про систему
